# НАЧАЛО
#     ПОКА
# нашлось(01)
# ИЛИ
# нашлось(02)
# ИЛИ
# нашлось(03)
#         заменить(01, 2302)
#         заменить(02, 10)
#         заменить(03, 201)
#     КОНЕЦ
# ПОКА
# КОНЕЦ
#
# 40 единиц, 10 двоек и 8 троек.

s = '0'

for x in range(55):
    for y in range(55):
        for z in range(55):
            s = f"0{'1' * x}{'2' * y}{'3' * z}"
            while '01' in s or '02' in s or '03' in s:
                s = s.replace('01', '2302', 1)
                s = s.replace('02', '10', 1)
                s = s.replace('03', '201', 1)
            if s.count('1') == 40 and s.count('2') == 10 and s.count('3') == 8:
                print(x)
